src/Catalogs/Scan_ЗаказыНаЗавод/Scan_ЗаказыНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ЗаказыНаЗавод</name>
  <comment>Предварительно справочник</comment>
  <attributes>
    <name>DDDeviation</name>
    <type>
      <types>CatalogRef.Scan_ПричиныОтклоненийПоDD</types>
    </type>
  </attributes>
  <attributes>
    <name>DDPriority</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГотовностьТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБукингЛиста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБукингЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойСтатусЗаказа</name>
    <type>
      <types>CatalogRef.Scan_ЗаводскиеСтатусыЗаказаНаЗавод</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикCOW</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыНаЗакупкуOFMSПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыНаЗакупкуПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАдресаДоставки</name>
    <type>
      <types>CatalogRef.Scan_КодыАдресовДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КузовщикиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроизводства</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НапоминаниеДилерамОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБукингЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецЗаказчика</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыНаЗакупку</name>
    <attributes>
      <name>Кузовщик</name>
      <type>
        <types>CatalogRef.Scan_Контрагенты</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаЗакупку</name>
      <type>
        <types>String</types>
        <types>DocumentRef.Scan_ЗаказНаЗакупку</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ХарактеристикиЗаказовНаЗавод/Scan_ХарактеристикиЗаказовНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ХарактеристикиЗаказовНаЗавод</name>
  <comment>История заказов на завод  (scania)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Scan_ПричиныОтклоненийПоDD</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_ЛокальныеСтатусыПродуктов</types>
      <types>EnumRef.Scan_ТипыЗаказовНаЗавод</types>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.Scan_КомплектностьПоставкиЗначения</types>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_ЗаводскиеСтатусыЗаказаНаЗавод</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Scan_КлючевыеДатыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КлючевыеДатыПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_ОбъектыКлючевыхДат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ОчередьDD2DDSИнформера/Scan_ОчередьDD2DDSИнформера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ОчередьDD2DDSИнформера</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод/Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод</name>
  <enumValues>
    <name>ADD</name>
    <comment>10271</comment>
  </enumValues>
  <enumValues>
    <name>CDD</name>
  </enumValues>
  <enumValues>
    <name>CDD2</name>
  </enumValues>
  <enumValues>
    <name>CDDX</name>
  </enumValues>
  <enumValues>
    <name>CDDY</name>
  </enumValues>
  <enumValues>
    <name>CDDПоставщик</name>
  </enumValues>
  <enumValues>
    <name>DDDeviation</name>
  </enumValues>
  <enumValues>
    <name>DDPriority</name>
  </enumValues>
  <enumValues>
    <name>DealerID_COW</name>
  </enumValues>
  <enumValues>
    <name>FFUНомер</name>
  </enumValues>
  <enumValues>
    <name>IDExternalSystem</name>
  </enumValues>
  <enumValues>
    <name>MarketChange</name>
    <comment>14327</comment>
  </enumValues>
  <enumValues>
    <name>PartPeriod</name>
    <comment>14312</comment>
  </enumValues>
  <enumValues>
    <name>SOrderНомер</name>
  </enumValues>
  <enumValues>
    <name>АвтомобильПроданСоСканияРусь</name>
  </enumValues>
  <enumValues>
    <name>ВывозИзПорта</name>
  </enumValues>
  <enumValues>
    <name>ГотовностьТС</name>
  </enumValues>
  <enumValues>
    <name>ДатаБукингЛиста</name>
  </enumValues>
  <enumValues>
    <name>ДатаГрузовогоБилета</name>
  </enumValues>
  <enumValues>
    <name>ДатаОбновления</name>
  </enumValues>
  <enumValues>
    <name>ЕстьАдресДоставки</name>
  </enumValues>
  <enumValues>
    <name>ЕстьБукингЛист</name>
  </enumValues>
  <enumValues>
    <name>ЗаводскойСтатусЗаказа</name>
    <comment>14223</comment>
  </enumValues>
  <enumValues>
    <name>Заказчик</name>
  </enumValues>
  <enumValues>
    <name>ЗаказчикCOW</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыНаЗакупкуOFMSПредставление</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыНаЗакупкуПредставление</name>
  </enumValues>
  <enumValues>
    <name>ЗапретНаИзменениеСкладаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Клиент</name>
    <comment>14327</comment>
  </enumValues>
  <enumValues>
    <name>КодАдресаДоставки</name>
  </enumValues>
  <enumValues>
    <name>КомплектностьПоставки</name>
  </enumValues>
  <enumValues>
    <name>Кузовостроитель</name>
  </enumValues>
  <enumValues>
    <name>КузовщикиПредставление</name>
  </enumValues>
  <enumValues>
    <name>МестоПроизводства</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеАдмПродажОтправлено</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеДилерамОтправлено</name>
  </enumValues>
  <enumValues>
    <name>НомерБукингЛиста</name>
  </enumValues>
  <enumValues>
    <name>НомерГрузовогоБилета</name>
  </enumValues>
  <enumValues>
    <name>ОбработаноОП</name>
  </enumValues>
  <enumValues>
    <name>ОдобреноПолучениеПродукта</name>
  </enumValues>
  <enumValues>
    <name>ПолученГрузовойБилет</name>
  </enumValues>
  <enumValues>
    <name>ПортСПБ</name>
  </enumValues>
  <enumValues>
    <name>ПоступилМашинокомплект</name>
  </enumValues>
  <enumValues>
    <name>ПродавецЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ПродуктГотов</name>
  </enumValues>
  <enumValues>
    <name>ПродуктГотовКПродаже</name>
  </enumValues>
  <enumValues>
    <name>ПродуктДатаГотовности</name>
  </enumValues>
  <enumValues>
    <name>СкладОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>СозданВручную</name>
  </enumValues>
  <enumValues>
    <name>СтатусЗаказа</name>
    <comment>14226</comment>
  </enumValues>
  <enumValues>
    <name>Тахограф</name>
  </enumValues>
  <enumValues>
    <name>ТипЗаказаНаЗавод</name>
    <comment>14226</comment>
  </enumValues>
  <enumValues>
    <name>ТОВыполнено</name>
  </enumValues>
  <enumValues>
    <name>ТягачШасси</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_ЗаказыНаЗавод/ObjectModule.bsl
Перем ЗагруженБукингЛист;	//rarus tenkam 25.0.2017 mantis 7176 +
Перем ИзмРекв; //rarus samkir 14.04.2017 9322 +
//Перем ПроверитьЗаказчика;	// rarus tenkam 22.02.2018 mantis 12718 + //rarus bonmak 26.08.2019 14430

//rarus BProg_Gladkov 20.11.2019 0014452 ++ Возможность изменения ключевых дат при записи.
Перем СтарыеКлючевыеДаты Экспорт;
Перем НовыеКлючевыеДаты Экспорт;
//rarus BProg_Gladkov 20.11.2019 0014452 -- 

Процедура ПередЗаписью(Отказ)
	//rarus sergei 09.11.2016 mantis 7163 ++
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus sergei 09.11.2016 mantis 7163 --
	
	//rarus BProg_Gladkov 20.11.2019 0014452 ++ Возможность изменения ключевых дат при записи.
	Если ДополнительныеСвойства.Свойство("КлючевыеДатыОбъекта") тогда
		НовыеКлючевыеДаты = ДополнительныеСвойства.КлючевыеДатыОбъекта;
	КонецЕсли;
	
	//rarus bonmak 26.12.2019 15558 ++
	//было
	//НовыеКлючевыеДаты.CDDX = Справочники.Scan_ЗаказыНаЗавод.РассчитатьCDDX(НовыеКлючевыеДаты.CDD, НовыеКлючевыеДаты.CDD2, НапоминаниеДилерамОтправлено); 
	CDDX = Справочники.Scan_ЗаказыНаЗавод.РассчитатьCDDX(НовыеКлючевыеДаты.CDD, НовыеКлючевыеДаты.CDD2, НапоминаниеДилерамОтправлено); 
	
	Если ЗначениеЗаполнено(CDDX) И CDDX <> НовыеКлючевыеДаты.CDDX Тогда
		НовыеКлючевыеДаты.CDDX = CDDX;
	КонецЕсли;
	//rarus bonmak 26.12.2019 15558 --
	//Справочники.Scan_ЗаказыНаЗавод.УстановитьCDDX(ЭтотОбъект);		//rarus Sergei 11.08.2016 Mantis 6925 исправление замечаний
	//rarus BProg_Gladkov 20.11.2019 0014452 -- 
	
	//rarus tenkam 04.10.2016 mantis 7183 ++
	Если НЕ Отказ  Тогда
		//rarus BProg_Gladkov 20.11.2019 0014452 ++ Возможность изменения ключевых дат при записи.
		//СтруктураОтбора   		= Новый Структура("Объект, ОбъектКлючевойДаты, ВидКлючевойДаты", Ссылка, Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, Перечисления.Scan_КлючевыеДаты.FinishDate);
		//ДатаГотовностиПродукта 	= РегистрыСведений.Scan_КлючевыеДатыПроцессов.ПолучитьПоследнее(ТекущаяДатаСеанса(), СтруктураОтбора).Значение;
		//ДатаГотовностиПродукта		= НовыеКлючевыеДаты.FinishDate;//rarus vikhle 15.04.2020 mt 15965 закомментировал
		//rarus BProg_Gladkov 20.11.2019 0014452 -- 
		
		//Справочники.Scan_ЗаказыНаЗавод.УстановитьДатуГотовностиПродукта(ЭтотОбъект, ДатаГотовностиПродукта); //rarus vikhle 15.04.2020 mt 15965 закомментировал
		
		// rarus tenkam 22.02.2018 mantis 12718 +++      		
		Если НЕ ЗначениеЗаполнено(СтарыеКлючевыеДаты.CDD) И ЗначениеЗаполнено(НовыеКлючевыеДаты.CDD) Тогда
			//ПроверитьЗаказчика = Истина;	// rarus tenkam 14427 + удалить по 14430 + //rarus bonmak 26.08.2019 14430 
			
			// rarus tenkam 07.08.2019 mantis 14427 +++
			Если НЕ ЗначениеЗаполнено(Заказчик) Тогда
				Заказчик = Справочники.Scan_Контрагенты.СканияРусь;
			КонецЕсли;			
			// rarus tenkam 07.08.2019 mantis 14427 ---
		//rarus bonmak 26.08.2019 14430 ++	
		//Иначе
			//ПроверитьЗаказчика = Ложь;		// rarus tenkam 14427 + удалить по 14430 +
		//rarus bonmak 26.08.2019 14430 --
		КонецЕсли;		
		// rarus tenkam 22.02.2018 mantis 12718 ---   

	КонецЕсли;
	//rarus tenkam 04.10.2016 mantis 7183 --
	//rarus abrant 02.05.2017 mantis 8698 +++
	//rarus tenkam 25.01.2017 mantis 7176 ++
	//СтароеЗначение = Ссылка.ЕстьБукингЛист;
	//Если СтароеЗначение <> ЕстьБукингЛист И ЕстьБукингЛист = Истина И 
	//	НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоФайлОтПоставщика") Тогда		//rarus tenkam 06.02.2017 mantis 7176 +
	//	ЗагруженБукингЛист = Истина; 
	//Иначе
	//	ЗагруженБукингЛист = Ложь;
	//КонецЕсли;
	//rarus tenkam 25.01.2017 mantis 7176 --
	//rarus abrant 02.05.2017 mantis 8698 ---	
	////rarus abrant 27.04.2017 mantis 8698 +++
	//СтароеЗначение = Ссылка.ПолученГрузовойБилет;
	//Если СтароеЗначение <> ПолученГрузовойБилет И ПолученГрузовойБилет = Истина И 
	//	НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоФайлОтПоставщика") Тогда
	//	ЗагруженГрузовойБилет = Истина; 
	//Иначе
	//	ЗагруженГрузовойБилет = Ложь;
	//КонецЕсли;
	////rarus abrant 27.04.2017 mantis 8698 ---
	
	//rarus BProg_Dekin 18.05.2020 mantis 0015999 ++ Закоментировал установку локального статуса
	////rarus bonmak 15.08.2019 14576 ++
	//Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
	//	ТипЗаказа = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.ТипЗаказаНаЗавод); 
	//	Если ЗаводскойСтатусЗаказа.СтатусCOW = 45 И ТипЗаказа <> Перечисления.Scan_ТипыЗаказовНаЗавод.OpenOrder 
	//		И ТипЗаказа <> Перечисления.Scan_ТипыЗаказовНаЗавод.ПустаяСсылка() И СтатусЗаказаЛокальный <> Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.Deleted Тогда
	//		СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.Deleted;
	//	КонецЕсли;
	//	
	//	// rarus tenkam 13.04.2020 mantis 15958 +++
	//	Если СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.ПустаяСсылка() Тогда
	//	//Если ЗаводскойСтатусЗаказа.СтатусCOW = 15 И СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.ПустаяСсылка() Тогда
	//	// rarus tenkam 13.04.2020 mantis 15958 ---
	//		СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.NEW;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////rarus bonmak 15.08.2019 14576 --
	//rarus BProg_Dekin 18.05.2020 mantis 0015999 --
	
	//rarus samkir 14.04.2017 9322 +++
	ИзмРекв = Новый Массив;
	//Если новый - запишем заполненные реквизиты
	Если ЭтотОбъект.ЭтоНовый() тогда
		Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("Булево") и ЭтотОбъект[Рекв.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Рекв.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Рекв.Имя);
		КонецЦикла;
	Иначе  //если не новый - то измененные
		Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("НеЗаписыватьВРегистр") Тогда //rarus bonmak 15.08.2019 14576 добавил условие, используется в внешней обработке
			Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
				Если (ЭтотОбъект[Рекв.Имя] <> ссылка[Рекв.Имя]) Тогда
					ИзмРекв.Добавить(Рекв.Имя);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//для старых объектов, у которых нет данных в регистре - запишем заполненные
	Если ИзмРекв.Количество() = 0 и  НетИсторииВРегистре(ссылка) Тогда
		Для каждого Рекв из ЭтотОбъект.Метаданные().Реквизиты Цикл
			Если ТипЗнч(ЭтотОбъект[Рекв.Имя]) = Тип("Булево") и ЭтотОбъект[Рекв.Имя] = Ложь Тогда
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект[Рекв.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			ИзмРекв.Добавить(Рекв.Имя);
		КонецЦикла;
	КонецЕсли;


	//rarus samkir 14.04.2017 9322 ---	
	
	//rarus BProg_Dekin 12.03.2020 mantis 0015725 ++
	ГотовностьТС = ЗначениеЗаполнено(НовыеКлючевыеДаты.RFT);
	//rarus BProg_Dekin 12.03.2020 mantis 0015725 --
КонецПроцедуры

//rarus samkir 18.04.2017 9322 +++
Функция НетИсторииВРегистре(Заказ) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ХарактеристикиЗаказовНаЗавод.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.Scan_ХарактеристикиЗаказовНаЗавод КАК Scan_ХарактеристикиЗаказовНаЗавод
	               |ГДЕ
	               |	Scan_ХарактеристикиЗаказовНаЗавод.Заказ = &Заказ";
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;				   				   
КонецФункции
//rarus samkir 18.04.2017 9322 ---

Процедура ПриЗаписи(Отказ)
	Справочники.Scan_ЗаказыНаЗавод.ЗаписатьЛогКонтрольныхТочек(ЭтотОбъект);
	
	//rarus abrant 27.04.2017 mantis 8698 +++
	////rarus tenkam 25.01.2017 mantis 7176 ++
	//Если ЗагруженБукингЛист Тогда
	//	ТекстНапоминания = "У заказа на завод №" + Наименование + " появился букинг-лист."; 
	//	Scan_ВспомогательныеФункцииСервер.СформироватьНапоминаниеПользователямПоПраву("УведомлятьОЗагрузкеБукингЛиста", ТекстНапоминания, Ссылка);
	//КонецЕсли;   	
	////rarus tenkam 25.01.2017 mantis 7176 --
	//rarus abrant 27.04.2017 mantis 8698 ---
	
	//rarus vikhle 31.08.2021 mt 17933 +++
	ИзмененаDDPriority		= Ложь; //rarus vikhle 09.09.2021 mt 17933
	ПрошлаяDDPriorityПустая = Ложь;
		
	Если Не ИзмРекв.Найти("DDPriority") = Неопределено Тогда
		
		ИзмененаDDPriority = Истина;
		
		//Если Не ЗначениеЗаполнено(DDPriority) Тогда
		//	РегистрыСведений.Scan_ОчередьDD2DDSИнформера.УдалитьЗаписьПоЗаказу(Ссылка);
		//Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Scan_ХарактеристикиЗаказовНаЗаводСрезПоследних.Значение КАК Значение
		               |ИЗ
		               |	РегистрСведений.Scan_ХарактеристикиЗаказовНаЗавод.СрезПоследних(
		               |			,
		               |			Заказ = &Ссылка
		               |				И Реквизит = ЗНАЧЕНИЕ(Перечисление.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.DDPriority)) КАК Scan_ХарактеристикиЗаказовНаЗаводСрезПоследних";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ПрошлаяDDPriorityПустая = Не ЗначениеЗаполнено(Выборка.Значение);
		Иначе
			ПрошлаяDDPriorityПустая = Истина;
		КонецЕсли;	
	  //КонецЕсли;	
	КонецЕсли;	
	//rarus vikhle 31.08.2021 mt 17933 ---
		
	//rarus samkir 14.04.2017 9322 +++
	Если не Отказ Тогда
		Для Каждого Реквизит из	ИзмРекв Цикл
			//rarus bonmak 15.08.2019 14576 ++
			фРеквизит = Реквизит;
			//rarus BProg_Dekin 20.05.2020 mantis 0015999 ++ Статус заказа на завод больше не используется
			//Если Реквизит = "СтатусЗаказаЛокальный" Тогда
			//	//добавим в очередь реквизит		
			//	РегистрыСведений.Scan_Обмен1БДОчередьПоОтправкеРеквизитов.ЗаписьЗначенияРегистраСведения(Ссылка, Перечисления.Scan_ВидыЗапроса.SetOrderToDelivery, "ЛокальныйСтатуc", Ссылка[Реквизит]); 	
			//КонецЕсли;
			//rarus BProg_Dekin 20.05.2020 mantis 0015999 --
			//rarus bonmak 15.08.2019 14576 --
			нЗапись = РегистрыСведений.Scan_ХарактеристикиЗаказовНаЗавод.СоздатьМенеджерЗаписи();
			нЗапись.Период = ТекущаяДата();
			нЗапись.Заказ = Ссылка;
			нЗапись.Реквизит = Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод[фРеквизит]; //rarus bonmak 15.08.2019 14576 было Реквизит
			нЗапись.Значение = Ссылка[Реквизит];
						
			//rarus FominskiyAS 28.02.2019  mantis 13863 +++
			//нЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			нЗапись.Пользователь = ПользователиСлужебный.АвторизованныйПользователь();
			//rarus FominskiyAS 28.02.2019  mantis 13863 ---
		    			
			нЗапись.Записать();
		КонецЦикла;
		
		// rarus tenkam 22.02.2018 mantis 12718 +++      		
		//Если ПроверитьЗаказчика Тогда //rarus bonmak 26.08.2019 14430 закомментировал условие
			// rarus tenkam 12.08.2019 mantis 14427 +++
			//ТекПродукт = РегистрыСведений.Scan_ВзаимосвязьИзделийПродуктовИЗаказов.ПолучитьПродуктПоЗаказу(ЭтотОбъект.Ссылка);
			//Если ТекПродукт <> Справочники.Scan_Продукты.ПустаяСсылка() И НЕ ЗначениеЗаполнено(ТекПродукт.Заказчик) Тогда
			//	ПродуктОбъект = ТекПродукт.ПолучитьОбъект();
			//	ПродуктОбъект.Заказчик = Справочники.Scan_Контрагенты.СканияРусь;
			//	Попытка
			//		ПродуктОбъект.Записать();
			//	Исключение
			//		//rarus FominskiyAS 08.07.2019  mantis 14191 +++
			//		//Сообщить("Не удалось записать в продукт заказчика Скания-Русь");
			//		Сообщить(НСтр("ru = 'Не удалось записать в продукт заказчика Скания-Русь'; en = 'Unable to save Scania Rus as a customer'"));
			//		//rarus FominskiyAS 08.07.2019  mantis 14191 ---  					
			//	КонецПопытки;
			//КонецЕсли;
			/// rarus tenkam 12.08.2019 mantis 14427 ---
		//КонецЕсли;		
		// rarus tenkam 22.02.2018 mantis 12718 --- 
		
		// rarus tenkam 13.05.2019 mantis 14226 +++
		//rarus bonmak 15.08.2019 14576 ++
		//ТипЗаказа = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.ТипЗаказаНаЗавод); 
		//Если ЗаводскойСтатусЗаказа.СтатусCOW = 45 И 
		//	(ТипЗаказа <> Перечисления.Scan_ТипыЗаказовНаЗавод.AOrder И ТипЗаказа <> Перечисления.Scan_ТипыЗаказовНаЗавод.OpenOrder) Тогда
		//	Справочники.Scan_ЗаказыНаЗавод.УстановитьСтатусЗаказаНаЗавод(Ссылка, Перечисления.Scan_СтатусыЗаказовНаЗавод.Delete);
		//КонецЕсли;
		//rarus bonmak 15.08.2019 14576 --
		// rarus tenkam 13.05.2019 mantis 14226 ---
	КонецЕсли;
	//rarus samkir 14.04.2017 9322 ---
	
	//rarus BProg_Gladkov 20.11.2019 0014452 ++ Запись ключевых дат перемещена из "ПослеЗаписи" формы в "ПриЗаписи" объекта.
	ИзмененныеКлючевыеДаты = Новый Структура;
	Для каждого Элемент Из СтарыеКлючевыеДаты Цикл
		Если НовыеКлючевыеДаты[Элемент.Ключ] <> СтарыеКлючевыеДаты[Элемент.Ключ] тогда
			ИзмененныеКлючевыеДаты.Вставить(Элемент.Ключ, НовыеКлючевыеДаты[Элемент.Ключ]);
		КонецЕсли;
	КонецЦикла; 
	РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЗаписатьКлючевыеДатыОбъекта(Ссылка, ИзмененныеКлючевыеДаты);
	//rarus BProg_Gladkov 20.11.2019 0014452 --
	
	//rarus pechek 20.04.2020 mantis 15943 +++	
	Если Не Отказ Тогда
		Если Scan_ПраваИНастройки.Scan_Право("ЗаполнятьРегистрСводнаяИнформацияПоПродукту") Тогда
			
			ИзмененныеРеквизитыПроверка = Новый  Массив;
			//ИзмененныеРеквизитыПроверка.Добавить("СтатусЗаказаЛокальный"); //rarus BProg_Dekin 18.05.2020 mantis 0015999 +-
			ИзмененныеРеквизитыПроверка.Добавить("КодАдресаДоставки");
			
			Для Индекс = 0 По ИзмененныеРеквизитыПроверка.Количество() - 1 Цикл 
				ВидЗначения = Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод[ИзмененныеРеквизитыПроверка[Индекс]];
				РегистрыСведений.Scan_СводнаяИнформацияПоПродукту.ЗаписьЗначенияРегистраСводнаяИнформацияПоПродукту(,Ссылка,ВидЗначения,Ссылка[ИзмененныеРеквизитыПроверка[Индекс]]);
			КонецЦикла;  			
		КонецЕсли;
	КонецЕсли;
	//rarus pechek 20.04.2020 mantis 15943 --- 		
	
	//rarus vikhle 03.09.2021 mt 17933 +++
	Если НЕ Отказ И ИзмененаDDPriority Тогда
		Если ЗначениеЗаполнено(DDPriority) //rarus vikhle 09.09.2021 mt 17933
			И ПрошлаяDDPriorityПустая 
			И НЕ РегистрыСведений.Scan_ОчередьDD2DDSИнформера.ЕстьЗаписьПоЗаказу(Ссылка) //rarus vikhle 08.09.2021 mt 17933
			И РегистрыСведений.Scan_ОчередьDD2DDSИнформера.НужноДобавитьЗапись(Ссылка) Тогда
			РегистрыСведений.Scan_ОчередьDD2DDSИнформера.ДобавитьЗаписьПоЗаказу(Ссылка);
		ИначеЕсли НЕ ЗначениеЗаполнено(DDPriority) //rarus vikhle 09.09.2021 mt 17933 +++
			И НЕ ПрошлаяDDPriorityПустая
			И РегистрыСведений.Scan_ОчередьDD2DDSИнформера.ЕстьЗаписьПоЗаказу(Ссылка)
			И НЕ РегистрыСведений.Scan_ОчередьDD2DDSИнформера.НужноДобавитьЗапись(Ссылка) Тогда
			РегистрыСведений.Scan_ОчередьDD2DDSИнформера.УдалитьЗаписьПоЗаказу(Ссылка);
		КонецЕсли;//rarus vikhle 09.09.2021 mt 17933 ---	
	КонецЕсли;
	//rarus vikhle 03.09.2021 mt 17933 ---
		
	Справочники.Scan_Изделия.УстановитьСтатусПродуктаDELETE(Ссылка); //rarus BProg_Dekin 25.05.2020 mantis 0015999 +-
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) // Rarus tenkam 15.12.2021 mantis 18574 +++
	
	Для Индекс = 0 по ЗаказыНаЗакупку.Количество()-1 Цикл
		ТекСтрока = ЗаказыНаЗакупку.Получить(Индекс);
		Если ЗначениеЗаполнено(ТекСтрока.ПорядковыйНомер) Тогда
			ПараметрыОтбора = Новый Структура("ПорядковыйНомер",ТекСтрока.ПорядковыйНомер);
			НайденныеСтроки = ЗаказыНаЗакупку.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 1 Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + Индекс + " указан неуникальный порядковый номер кузовостроителя";
				Сообщение.Поле = "ЗаказыНаЗакупку[" + Индекс + "].ПорядковыйНомер";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // Rarus tenkam 15.12.2021 mantis 18574 ---


//Процедура ПередЗаписью(Отказ)
//	
//	Если ЗначениеЗаполнено(Продукт) Тогда
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ
//		|	Scan_ВзаимосвязьПродуктовИКарточекЗаказов.КарточкаЗаказа
//		|ИЗ
//		|	РегистрСведений.Scan_ВзаимосвязьПродуктовИКарточекЗаказов КАК Scan_ВзаимосвязьПродуктовИКарточекЗаказов
//		|ГДЕ
//		|	Scan_ВзаимосвязьПродуктовИКарточекЗаказов.Продукт = &ПродуктСсылка";
//		
//		Запрос.УстановитьПараметр("ПродуктСсылка",Продукт);
//		Выборка = Запрос.Выполнить().Выбрать();
//		Если Выборка.Следующий() Тогда
//			
//			Если Ссылка<>Выборка.КарточкаЗаказа Тогда
//				 	Отказ = Истина;
//					Сообщить("Продукт уже записан в другую карточку заказа");
//			КонецЕсли; 
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//		
//КонецПроцедуры

//rarus BProg_Gladkov 20.11.2019 0014452 ++ Возможность изменения ключевых дат при записи.
СтарыеКлючевыеДаты = РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючевыеДатыОбъекта(Ссылка);
НовыеКлючевыеДаты  = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтарыеКлючевыеДаты);
//rarus BProg_Gladkov 20.11.2019 0014452 --
